{
  "categories": [
    "AIML",
    "Assets",
    "CS Fundamentals",
    "Frontend",
    "Pieces Specific",
    "Search"
  ],
  "terms": [
    {
      "term": "AI Code Refactoring",
      "definition": "AI Code Refactoring refers to the systematic modification of software code to enhance its design, readability, and maintainability without altering its external behavior — just with the added ingredient of AI code.",
      "category": "AIML",
      "referencePath": "terms/AIML/ai-code-refactoring"
    },
    {
      "term": "AI Code Review",
      "definition": "AI Code Review refers to the use of artificial intelligence technologies to analyze and improve code quality in software development.",
      "category": "AIML",
      "referencePath": "terms/AIML/ai-code-review"
    },
    {
      "term": "Accessor",
      "definition": "An accessor is a feature that tracks who has accessed a shared snippet and how many times they have accessed it.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/accessor"
    },
    {
      "term": "Activities",
      "definition": "A way to track and manage the progress of tasks and projects within Pieces OS.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/activities"
    },
    {
      "term": "Aesthetics",
      "definition": "A set of properties that control the visual appearance of an object, such as its color, size, and shape.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/aesthetics"
    },
    {
      "term": "Ahead of Time Compilation",
      "definition": "Ahead of time compilation (AOT compilation) is a process in software development where programs are compiled into native machine code before runtime.",
      "category": "CS Fundamentals",
      "referencePath": "terms/CS Fundamentals/ahead-of-time-compilation"
    },
    {
      "term": "Analysis",
      "definition": "An object used for storing various analysis models like image analysis and code analysis.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/analysis"
    },
    {
      "term": "Anchor",
      "definition": "A reference to a specific file or folder location on a machine.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/anchor"
    },
    {
      "term": "Annotation",
      "definition": "A versatile tool that facilitates the addition of comments, summaries, and various other types of annotations to enhance understanding and provide additional context.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/annotation"
    },
    {
      "term": "Application",
      "definition": "An application is used to identify the source of a format/analytics event.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/application"
    },
    {
      "term": "Asset",
      "definition": "An asset model represents data extracted from an application connecting a group of data containing one or more formats.",
      "category": "Assets",
      "referencePath": "terms/Assets/asset"
    },
    {
      "term": "Associate",
      "definition": "Associate endpoints are used to build relationships between materials, like associating a related website or a tag with an asset.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/associate"
    },
    {
      "term": "Auth0 User",
      "definition": "In Pieces, an Auth0 User represents a user who has been authenticated through Auth0.",
      "category": "CS Fundamentals",
      "referencePath": "terms/CS Fundamentals/auth0-user"
    },
    {
      "term": "Backtracking",
      "definition": "Backtracking is an algorithmic technique used to solve problems by systematically exploring all possible solutions.",
      "category": "CS Fundamentals",
      "referencePath": "terms/CS Fundamentals/backtracking"
    },
    {
      "term": "Classification",
      "definition": "Classification is a machine-learning task that involves assigning a label to an input data point.",
      "category": "AIML",
      "referencePath": "terms/AIML/classification"
    },
    {
      "term": "Context",
      "definition": "Context contains information about the current context or state of the application.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/context"
    },
    {
      "term": "Context Awareness",
      "definition": "Context awareness is the capability of Pieces to gather information about some code’s context or environment at any given time.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/context-awareness"
    },
    {
      "term": "Context Window",
      "definition": "The frame of reference that a language model uses to understand or generate language based on a fixed span of words or tokens surrounding a specific point.",
      "category": "AIML",
      "referencePath": "terms/AIML/context-window"
    },
    {
      "term": "Copilot",
      "definition": "An AI copilot is a development assistant that can help generate, answer questions about, troubleshoot, and debug code.",
      "category": "AIML",
      "referencePath": "terms/AIML/copilot"
    },
    {
      "term": "Debugging AI",
      "definition": "Debugging AI refers to the use of artificial intelligence (AI) tools to enhance the process of identifying and fixing bugs in software code. These tools leverage AI technologies to automate and optimize the debugging process, making it more efficient and less prone to human error.",
      "category": "AIML",
      "referencePath": "terms/AIML/debugging-ai"
    },
    {
      "term": "Disassociate",
      "definition": "Endpoints used to remove a relationship, such as removing a tag from an asset after using an associate endpoint.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/disassociate"
    },
    {
      "term": "Discovered Assets",
      "definition": "A collection of discovered assets is used in the bulk upload flow for clustering and uploading snippets.",
      "category": "Assets",
      "referencePath": "terms/Assets/discovered-assets"
    },
    {
      "term": "Discovery API",
      "definition": "The Discovery API provides endpoints for discovering assets, HTML webpages, sensitives, and related tags.",
      "category": "Search",
      "referencePath": "terms/Search/discovery-api"
    },
    {
      "term": "Distribution",
      "definition": "A distribution object represents a channel through which notifications can be sent. Currently, Pieces supports distribution for GitHub, with each distribution having its own unique set of properties and configuration options.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/distribution"
    },
    {
      "term": "Edges",
      "definition": "The 'Edges' object represents a collection of nodes in a graph structure.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/edges"
    },
    {
      "term": "Embedding",
      "definition": "Embedding is a technique that converts discrete data into a continuous vector space.",
      "category": "AIML",
      "referencePath": "terms/AIML/embedding"
    },
    {
      "term": "Enrich",
      "definition": "Enrich enables developers to modify the enrichment levels of the persons, tags, and websites associated with an asset, ensuring the number of people/tags/websites does not exceed the provided value.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/enrich"
    },
    {
      "term": "Formats",
      "definition": "Formats refer to the specific structures or representations used to encode, store, and transmit data.",
      "category": "CS Fundamentals",
      "referencePath": "terms/CS Fundamentals/formats"
    },
    {
      "term": "Full-text search (FTS)",
      "definition": "Full-text search (FTS) is a search method that allows users to find assets by searching for specific words or phrases within the content of those assets.",
      "category": "Search",
      "referencePath": "terms/Search/full-text-search"
    },
    {
      "term": "Ghost Assets",
      "definition": "Ghost assets enable assets that are added to Pieces but not included in typical snapshots, allowing for internal addition of assets without returning them to a user unless explicitly stated.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/ghost-assets"
    },
    {
      "term": "Global Search",
      "definition": "Global Search is a feature that allows users to search across all of their assets, regardless of where they are stored or what type of asset they are.",
      "category": "Search",
      "referencePath": "terms/Search/global-search"
    },
    {
      "term": "Hint",
      "definition": "The hint model is used to provide hints and suggested queries for assets, including properties such as the hint text, the mechanism by which the hint was generated, and the asset to which the hint is attached.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/hint"
    },
    {
      "term": "Hyper Parameter Tuning",
      "definition": "Hyperparameter tuning is a crucial step in the process of building and optimizing machine learning models. Hyperparameters are the configuration variables that govern the training process and structure of a machine-learning model. These could include the learning rate in a neural network, depth in a decision tree, or number of clusters in K-means clustering.",
      "category": "AIML",
      "referencePath": "terms/AIML/hyper-parameter-tuning"
    },
    {
      "term": "Indices",
      "definition": "This is a map of IDs or identifiers that map to a value which is an integer from -1 -> infinity. These index Maps are only on plural Models, such as Asset.websites, Asset.tags, or Assets, ...XYZ (in these cases Tags/Websites/Assets, but not limited to just these).",
      "category": "Search",
      "referencePath": "terms/Search/indices"
    },
    {
      "term": "Interacted Assets",
      "definition": "A collection of interacted assets, used in the bulk upload flow for clustering and uploading snippets.",
      "category": "Assets",
      "referencePath": "terms/Assets/interacted-assets"
    },
    {
      "term": "Iterable",
      "definition": "An Iterable refers to an array-like data structure that represents a sequence of elements.",
      "category": "CS Fundamentals",
      "referencePath": "terms/CS Fundamentals/iterable"
    },
    {
      "term": "LLM Fine-Tuning",
      "definition": "The process of adjusting a pre-trained AI model's parameters so it can perform better on specific tasks or datasets. Fine-tuning large language models is particularly beneficial when the model needs to adapt to specific or niche tasks where general models might not perform well without adjustments.",
      "category": "AIML",
      "referencePath": "terms/AIML/llm-fine-tuning"
    },
    {
      "term": "LangChain",
      "definition": "An open-source framework designed to streamline the development of applications powered by large language models (LLMs).",
      "category": "AIML",
      "referencePath": "terms/AIML/langchain"
    },
    {
      "term": "Language Server Protocol",
      "definition": "Language Server Protocol (LSP) is an open, JSON-RPC-based protocol for use between source code editors or integrated development environments (IDEs) and servers that provide language intelligence tools.",
      "category": "CS Fundamentals",
      "referencePath": "terms/CS Fundamentals/language-server-protocol"
    },
    {
      "term": "Large Language Models (LLMs)",
      "definition": "Large Language Models (LLMs) are a type of neural network that has been trained on diverse datasets, including vast amounts of text and, increasingly, multimodal data such as images, audio, and video.",
      "category": "AIML",
      "referencePath": "terms/AIML/large-language-models"
    },
    {
      "term": "Linkify",
      "definition": "The Linkify API generates a publicly sharable link for a code snippet, expecting an asset for the snippet and generating the link once the asset is passed into the API.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/linkify"
    },
    {
      "term": "Masked Language Modeling",
      "definition": "Masked Language Modeling (MLM) is a pre-training technique in natural language processing (NLP) that enables AI models to predict masked tokens within an input sequence, enhancing their understanding of language context and structure.",
      "category": "AIML",
      "referencePath": "terms/AIML/masked-language-modeling"
    },
    {
      "term": "Neural Code Search (NCS)",
      "definition": "Neural Code Search (NCS) is a method that leverages neural networks to find similar code snippets within a codebase based on natural language queries.",
      "category": "Search",
      "referencePath": "terms/Search/neural-code-search"
    },
    {
      "term": "Neural Machine Translation",
      "definition": "Neural Machine Translation (NMT) is an innovative technology that allows computers to translate languages with human-level fluency. Unlike previous approaches, NMT uses artificial intelligence to analyze and create translations that match the natural flow of language. It analyzes context, idioms, and subtleties to provide more accurate and contextually appropriate translations. This transformational technology uses neural networks to comprehend complicated linguistic patterns, allowing seamless communication across several languages. NMT's capacity to adapt and learn from varied linguistic data sets is a huge step forward in breaking down language barriers, boosting global connectedness, and improving cross-cultural communication.",
      "category": "AIML",
      "referencePath": "terms/AIML/neural-machine-translation"
    },
    {
      "term": "OS Instance",
      "definition": "Provides information to Pieces OS about the operating system being used by the host system.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/os-instance"
    },
    {
      "term": "Optical Character Recognition (OCR)",
      "definition": "Optical Character Recognition (OCR) is a technology that converts scanned or printed images into machine-readable text.",
      "category": "CS Fundamentals",
      "referencePath": "terms/CS Fundamentals/optical-character-recognition"
    },
    {
      "term": "PKCE Flow",
      "definition": "Proof Key for Code Exchange (PKCE) is an extension of the OAuth 2.0 authorization code flow that enhances security by eliminating the need to securely store and manage client secrets.",
      "category": "CS Fundamentals",
      "referencePath": "terms/CS Fundamentals/pkce-flow"
    },
    {
      "term": "Patterns Engine",
      "definition": "A software tool that can be used to identify and extract patterns from data.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/patterns-engine"
    },
    {
      "term": "Plural vs Singular API",
      "definition": "Plural APIs are used to handle multiple resources at once, while singular APIs are used to handle single resources.",
      "category": "CS Fundamentals",
      "referencePath": "terms/CS Fundamentals/plural-vs-singular-api"
    },
    {
      "term": "Quantized Generative Pre-trained Transformer (qGPT)",
      "definition": "qGPT is a quantized version of the Generative Pre-trained Transformer (GPT) language model.",
      "category": "AIML",
      "referencePath": "terms/AIML/quantized-generative-pre-trained-transformer"
    },
    {
      "term": "React Server Components",
      "definition": "React Server Components are a new addition to the React framework, designed to enable developers to build more efficient, performant applications. Learn how they work, how to create them, and their benefits and limitations.",
      "category": "Frontend",
      "referencePath": "terms/Frontend/react-server-components"
    },
    {
      "term": "Reaction",
      "definition": "The Reaction endpoint is used to react to the response given from the suggestion endpoint, allowing for a hybrid approach of user interaction/confirmation and auto-recommended uploads.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/reaction"
    },
    {
      "term": "Recipients",
      "definition": "Recipients is an iterable of People that are attached to a specific distribution, used in tandem with the Distribution endpoint to describe which distribution is being used.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/recipients"
    },
    {
      "term": "Related people",
      "definition": "Related people help to search through known users to pinpoint a person who could help understand/work with a given snippet, extending to natural language questions about specific programming problems or codebases.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/related-people"
    },
    {
      "term": "Relationship",
      "definition": "A relationship expresses a graph of like types to build a relationship graph, requiring iteration through edges to get the root or simply getting the first edge's type as a relationship can only be expressed through the same type.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/relationship"
    },
    {
      "term": "Relevance",
      "definition": "Relevance refers to all the relevant or useful information used to ground the model to better answer your question or query, specific to the qGPT flow.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/relevance"
    },
    {
      "term": "Retrieval-Augmented Generation (RAG)",
      "definition": "Retrieval-Augmented Generation (RAG) combines retrieval-based and generative-based approaches to generate responses by retrieving relevant information from a large corpus.",
      "category": "AIML",
      "referencePath": "terms/AIML/retrieval-augmented-generation"
    },
    {
      "term": "Reverse Proxy Tunnel",
      "definition": "A reverse proxy tunnel acts as an intermediary server that forwards requests from clients to a target server at a different location.",
      "category": "CS Fundamentals",
      "referencePath": "terms/CS Fundamentals/reverse-proxy-tunnel"
    },
    {
      "term": "Role",
      "definition": "This is the specific role of a format.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/role"
    },
    {
      "term": "Score",
      "definition": "Score is a model present for all materials, both plural and singular, that can be incremented individually as users use specific materials. This is relevant to specific algorithms used for the Feed and to determine which materials or actions to show.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/score"
    },
    {
      "term": "Seed",
      "definition": "A seed is a starting point for creating different materials in Pieces SDKs.",
      "category": "Assets",
      "referencePath": "terms/Assets/seed"
    },
    {
      "term": "SeededTag",
      "definition": "A SeededTag represents the minimum information needed when creating a Tag.",
      "category": "Assets",
      "referencePath": "terms/Assets/seededtag"
    },
    {
      "term": "Sensitives",
      "definition": "A 'sensitive' is defined as a piece of information that may be of a sensitive nature, such as an API key or service account, automatically extracted and linked into the assets creation.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/sensitives"
    },
    {
      "term": "Small Language Models",
      "definition": "Small language models are a type of AI that can understand and generate human language.",
      "category": "AIML",
      "referencePath": "terms/AIML/small-language-models"
    },
    {
      "term": "Smart Transforms",
      "definition": "Quickly transform code snippets with a single click to improve readability, format, and runtime performance, translate to your preferred language, or convert to boilerplate effortlessly.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/smart-transforms"
    },
    {
      "term": "Snapshot",
      "definition": "A snapshot is a GET request to the API that fetches data for a specific thing, singular or plural, as it exists in the database.",
      "category": "Assets",
      "referencePath": "terms/Assets/snapshot"
    },
    {
      "term": "Snippet",
      "definition": "A snippet is a small bit/fragment of code that is highly reusable, complex, hard to remember, etc.",
      "category": "Assets",
      "referencePath": "terms/Assets/snippet"
    },
    {
      "term": "TLP Code Processing",
      "definition": "TLP stands for Technical Language Processing, It’s quite similar to NLP (Natural Language Processing). TLP specifically focuses on processing technical language, particularly code. It involves techniques to understand, analyze, and derive insights from code.",
      "category": "CS Fundamentals",
      "referencePath": "terms/CS Fundamentals/tlp-code-processing"
    },
    {
      "term": "Tag",
      "definition": "A tag is any relevant tags or keywords assigned to your code snippet, used to group, organize, and search various assets.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/tag"
    },
    {
      "term": "Telemetry",
      "definition": "Telemetry is the collection, transmission, and analysis of data related to the performance, usage, and health of systems or devices.",
      "category": "CS Fundamentals",
      "referencePath": "terms/CS Fundamentals/telemetry"
    },
    {
      "term": "Vector Search",
      "definition": "Vector search is a sophisticated data retrieval method that utilizes mathematical vectors to analyze and process complex, unstructured data. Learn more about vector search, its benefits, drawbacks, and key takeaways.",
      "category": "AIML",
      "referencePath": "terms/AIML/vector-search"
    },
    {
      "term": "Well-Known Health",
      "definition": "The Well-Known Health model is a read-only model that provides information about the health of the OS server, including properties such as the OS health and the schema version.",
      "category": "Pieces Specific",
      "referencePath": "terms/Pieces Specific/well-known-health"
    },
    {
      "term": "Windows Subsystem for Linux (WSL)",
      "definition": "Windows Subsystem for Linux (WSL) enables the running of a Linux environment directly on Windows 10 or 11 systems. It allows developers and users to access and work with Linux tools, applications, and shell commands within the Windows operating system, simplifying cross-platform development and application deployment.",
      "category": "CS Fundamentals",
      "referencePath": "terms/CS Fundamentals/windows-subsystem-for-linux"
    },
    {
      "term": "qGPTseeds",
      "definition": "qGPTseeds are a set of pre-trained models for the qGPT language model.",
      "category": "AIML",
      "referencePath": "terms/AIML/qgptseeds"
    }
  ]
}